#coding = utf-8
'''
    标题 setdefault
    @name:  
    @function:
    @author: Mr.Fan
    @date:2021--
'''
'''
将列表内元素,根据位数合并成字典
eg:
    lst = [1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536,4294967296]
    #输出:
    {
        1:[1,2,4,8],
        2:[16,32,64],
        3,[126,256,512],
        4:[1024,2048,4096,8192],
        5:[16384,32768,66536],
        6:[14294967296]
    }
'''
dic = {}#存放最终结果 {1:[9,2]}
lst = [9,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536,4294967296]
for item in lst:
    it = str(item)
    if len(it) < 6:
        dic.setdefault(len(it),[]).append(item)  #{1:[9,2]}
    else:#a长度大于等于6的
        dic.setdefault(6,[]).append(item)
print(dic)
